var publicFn = {
    //获取指定路径地址中参数的值 http://localhost:3001/#/act/actedit?name=123&age=4895 
    getUrlValue:function (url,key){ // url: 链接地址  name:key值
        var reg = new RegExp("(^|&)"+ key +"=([^&]*)(&|$)");
        var serch = url.split('?')[1]
        var r = serch.match(reg);
        if(r!=null) return  unescape(r[2]); return null;
    },
    //去除字符串首位空格
    TrimLeftRight :function (str){
        return (str+"").replace(/(^\s?)|(\s?$)/,"")
    }
}
//正则表达式
var Reg = {
    phone:/^[1][3456789][0-9]{9}$/,
    price:/(^[1-9]([0-9]+)?(\.[0-9]{1,2})?$)|(^(0){1}$)|(^[0-9]\.[0-9]([0-9])?$)|(^[0-9]\.{1}$)|(^[1-9]([0-9]+)?(\.{1}$))/,
    rulePice:/(^[1-9]([0-9]+)?(\.[0-9]{1,2})?$)|(^(0){1}$)|(^[0-9]\.[0-9]([0-9])?$)/,
    tax:/(^1$)|(^1{1}\.0+$)|(^0{1}\.([0-9]+$))/,//小于等于1的比率
    rateTax:/^(([1-9][0-9]*)|0{1})((\.[0-9]+)|\.{1})?$/,//任意小数点
    num:/^(([1-9][0-9]*)|0{1})$/,
    email:/^(\w-*\.*)+@(\w-?)+(\.\w{2,})+$/,
    httpUrl:/^(?:http(s)?:\/\/)?[\w.-]+(?:\.[\w\.-]+)+[\w\-\._~:/?#[\]@!\$&'\*\+,;=.\%]+$/,
    http:/^(?:(http(s)?|bbgz):\/\/)?[\w.-]+(?:\.[\w\.-]+)+[\w\-\._~:/?#[\]@!\$&'\*\+,;=.]+$/,
    card:/^[1-9][0-9]{5}([1][9][0-9]{2}|[2][0][0|1][0-9])([0][1-9]|[1][0|1|2])([0][1-9]|[1|2][0-9]|[3][0|1])[0-9]{3}([0-9]|[X])$/,
    fixPhone:/^(\d3,4|\d{3,4}-)?\d{7,8}$/,
    testmoney:/^(0|[1-9]\d*)(\s|$|\.\d{1,2}\b)/, //大于等于0，最多保留两位小数的正则
}
